//1. 변수에 대해서 

let age = 27 // 변수 선언 , 중복된 이름으로 변수를 다시 선언할 수 없다. 

console.log(age)

//2. 상수에 대해서 

// 상수는 한번 저장하면, 다시 값을 저장할 수 없다.

const name = 'park'// const는 반드시 초기화가 필요하다 .

let a; 

// const; // 에러 발생 

// name = "20" // 에러 발생 

// 변수, 상성을 하는 행위를 변수 명명이라 한다. 

// 3. 변수 명명 규칙 ( 네이밍 규칙 ) #######################################

// 3-1. 변수 명에는 $, _ 를 제외한 기호는 사용할 수 없다. 


// let $name 
// let !name // 에러 발생

// 3-2. 숫자로 시작할 수 없다. 

// let 2name // 에러 발생 

// 3-3. 예약어는 변수로 선언할 수 없다.

// let let = 1 // 에러 발생

// let const = 1 // 에러 발생

// 4. 변수 명명 가이드 

